note/note-kc&kt.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>kyoto Cabinet &amp; Tycoon kv 型离线数据库</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">kyoto Cabinet &amp; Tycoon kv 型离线数据库</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge3553c2">1. install cabinet &amp; tycoon</a></li>
<li><a href="#orgb3ed199">2. tycoon 服务端</a></li>
<li><a href="#org79af5aa">3. tycoon 客户端</a></li>
<li><a href="#org5a30027">4. hot backup</a></li>
</ul>
</div>
</div>
<p>
这里是 <a href="http://fallabs.com/kyotocabinet/">cabinet</a> 和 <a href="http://fallabs.com/kyototycoon/">tycoon</a> 的官方地址,简单的说，cabinet提供存储服务,<br>
tycoon提供网络连接服务,两者配合使用，作为一款kv型离线数据库使用，<br>
备份及其方便，占用空间小，适用于高qps的api接口服务，此处记录下，在使用<br>
这款小众kv数据库中的一些记录.<br>
</p>

<p>
目前项目使用中数据量为亿级，由于作者已经不再维护此项目，项目kv单机数据库<br>
切换为pika.<br>
</p>

<p>
cabinet数据落地的存储类型有两种:<br>
</p>
<ul class="org-ul">
<li><p>
以kch结尾的文件<br>
</p>
<blockquote>
<p>
代表使用hash表存储数据，每个操作的时间复杂度是 O(1)<br>
</p>
</blockquote></li>
<li><p>
以kct结尾的文件<br>
</p>
<blockquote>
<p>
代表使用B+ tree表存储数据，每个操作的时间复杂度是 O(log N),<br>
</p>

<p>
但B+ tree数据库支持对key顺序的连续访问，这可以实现对字符串的<br>
</p>

<p>
前向匹配查找和整数的范围查找<br>
</p>
</blockquote></li>
</ul>

<div id="outline-container-orge3553c2" class="outline-2">
<h2 id="orge3553c2"><span class="section-number-2">1</span> install cabinet &amp; tycoon</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<ol class="org-ol">
<li><p>
install cabinet<br>
</p>
<pre class="example">
wget http://fallabs.com/kyotocabinet/pkg/kyotocabinet-1.2.76.tar.gz
tar xzvf kyotocabinet-1.2.76.tar.gz
cd kyotocabinet-1.2.76
./configure &amp;&amp; make &amp;&amp; make install &amp;&amp; cd ..
rm kyotocabinet-1.2.76* -rf

</pre></li>

<li><p>
install cabinet python binding<br>
</p>
<pre class="example">
wget http://fallabs.com/kyotocabinet/pythonlegacypkg/kyotocabinet-python-legacy-1.18.tar.gz
tar xzvf kyotocabinet-python-legacy-1.18.tar.gz
cd kyotocabinet-python-legacy-1.18
python setup.py install

</pre>
<p>
#fix 'libkyotocabinet.so.16: cannot open shared object file: No such file or directory' error<br>
</p>
<pre class="example">
echo "/usr/local/lib" &gt;&gt; /etc/ld.so.conf.d/usrlocal.conf
ldconfig -v &amp;&amp; cd ..
rm kyotocabinet-python-legacy-1.18* -rf

</pre></li>

<li><p>
install tycoon<br>
</p>
<pre class="example">
wget http://fallabs.com/kyototycoon/pkg/kyototycoon-0.9.56.tar.gz
cd kyototycoon-0.9.56
sed -i '24a\#include &lt;unistd.h&gt;' ktdbext.h
./configure &amp;&amp; make &amp;&amp; make install

</pre>
<p>
#fix ktserver: error while loading shared libraries: libkyototycoon.so.2: cannot open shared object file: No such file or directory<br>
</p>
<pre class="example">
cp libkyototycoon.so.2 /usr/lib
ldconfig -v &amp;&amp; cd ..
rm kyototycoon* -rf

</pre></li>
</ol>
</blockquote>
</div>
</div>

<div id="outline-container-orgb3ed199" class="outline-2">
<h2 id="orgb3ed199"><span class="section-number-2">2</span> tycoon 服务端</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
ktserver 作为服务端，提供数据库网络连接服务,其常用到的参数说明如下:<br>
</p>
<pre class="example">
port num : 指定需要绑定的端口号。默认端口号为1978
th num : 指定线程数
le : 日志记录级别---error
ls : 日志记录级别---system
onl : opens the database with the no locking option. 
pid file: 输出进程ID 到指定文件（这里指定文件名 
plsv file :  #支持memcache需要指明共享库/usr/local/libexec/ktplugservmemc.so
plex str : #指定了可插拔服务器配置的表达 port=8902 通过memcache访问kt的端口
tout num : 指定每个会话的超时时间（单位为秒）。默认永不超时
bnum 指定哈希表的桶数量。官方推荐是记录数的两倍或者更高。   10 million : bnum=20000000
msize 指定内存映射区域大小 小于系统内存  10 million : 10G
dfunit 设定一个值，当碎片数超过这个值系统就进行碎片整理。 
dmn   以daemon方式启动。 

</pre>

<p>
官方推荐两种启动kt服务方式:<br>
</p>

<ul class="org-ul">
<li><p>
Typical Server Setting<br>
</p>
<pre class="example">
ktserver -port 8901 \
        -th 32    \
        -log /var/log/kt_compromise.log \
        -le -onl   \
        -pid /var/log/kt_compromise.pid \
        -tout 10   \
        -plsv /usr/local/libexec/ktplugservmemc.so  \
        -plex port=8902 
        /root/data/compromise.kch#opts=l#bnum=5120000#msiz=3g#dfunit=8
</pre></li>
<li><p>
On-memory Server Setting<br>
</p>

<p>
数据加载到内存的方式 一般用来替代memcached服务,kt的空间使用效率要<br>
比memcached好,1000w每条1k文档存储到库内，需要10GB内存,kt服务一般<br>
会占用服务器65%左右内存<br>
</p>

<p>
在这种on-memory 模式下启动的数据库，备份快照方式同redis相同,<br>
定期将内存中的数据存入到目录,重启服务的时候，会将所有文档重新加载<br>
</p>

<p>
启动server后每10秒钟做快照以lzo压缩备份到/home/manue1目录下<br>
</p>
<pre class="example">
ktserver -port 2000 \
         -bgs /home/manue1/
         -bgsi 10 
         -bgsc lzo
         :#bnum=2000000#ktcapsiz=2g
</pre></li>
</ul>
</blockquote>
</div>
</div>
<div id="outline-container-org79af5aa" class="outline-2">
<h2 id="org79af5aa"><span class="section-number-2">3</span> tycoon 客户端</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
ktremotemgr 作为一款连接kt server的客户端工具,下面给出简单示例:<br>
</p>

<p>
插入数据<br>
</p>

<p>
<code>ktremotemgr set -host 127.0.0.1 -port 8901 manue1 360</code><br>
</p>

<p>
查询<br>
</p>

<p>
<code>ktremotemgr get -host 127.0.0.1 -port 8901 manue1</code><br>
</p>

<p>
删除<br>
</p>

<p>
<code>ktremotemgr remove -host 127.0.0.1 -port 8901 manue2</code><br>
</p>

<p>
列出所有key<br>
</p>

<p>
<code>ktremotemgr list -host 127.0.0.1 -port 8901</code><br>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org5a30027" class="outline-2">
<h2 id="org5a30027"><span class="section-number-2">4</span> hot backup</h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<p>
tycoon 以本地离线文件的信息存储到磁盘，迁移的时候可以直接使用快照或者库文件，<br>
下面提供热备份的详细步骤:<br>
</p>

<ol class="org-ol">
<li><p>
dbbackup.sh It must have executable permissions<br>
</p>
<pre class="example">
#! /bin/sh
srcfile="$1"
destfile="$1.$2"
cp -f "$srcfile" "$destfile"
</pre></li>
<li><p>
ktserver -cmd  -ulog  set<br>
</p>
<pre class="example">
server -port 1978 \
       -th 32    \
       -log /var/log/kt_malfile.log  \
       -sid 1 \
       -ulog /var/log/backup_update_log \
       -cmd /home/s/apps/malicious.file/tools \
       -li  \
       -pid  /var/log/kt_malfile.pid \
       -tout 10   \
       -onl   \
       -plsv /usr/local/libexec/ktplugservmemc.so  \
       -plex port=1979 \
       /root/data/malfile.kch#opts=l#bnum=5120000#msiz=3g#dfunit=8
</pre></li>
<li><p>
ktremotemgr make a backup file<br>
</p>

<p>
<code>ktremotemgr  sync -cmd dbbackup.sh</code><br>
</p></li>

<li><p>
recover kt data<br>
</p>

<p>
$1 is interactive arg : 01524834405899000000<br>
</p>
<pre class="example">
rm  /root/data/malfile.kch -f
cp   /root/data/malfile.kch.$1  /root/data/malfile.kch
kttimedmgr recover -ts $1 /root/data/malfile.kch /var/log/backup_update_log
#rm /var/log/backup_update_log/* -f
</pre></li>
</ol>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>